# **Project Name**
$\color{red}{\text{DPDzero Data Assignment}}$

# **Project Summary**

**Data Processing**

    1.Importing libraries
    2.Function for reading dataset
    3.dataset information 
    4.Missing values,Duplicated values

**Exploratory Data Analysis**

**Supervised Machine learning Algorithm**

```
# This is formatted as code
```

# **Problem Statement**

# **Data overview and column description**

**There are two dataset needed for the project**

## **portfolio data** 
**This contains the details on loans given to few customers and their demographic information**

| Column          | Description     |
| --------------- | --------------- |
| Loan Number     | Loan Number given to each customer  |
| Due Date        |  Repaying dae of loan by the customer |
| State           |  origin of state of each customer |
| DOB             |Date of birth of the customer   |
| Loan Amount     | Loan amount given to each customer |

## **Communication History**
**The attempts made to reach out to these customers and the status of these calls.**

| Column          | Description     |
| --------------- | --------------- |
| Loan Number     | Loan Number given to each customer  |
| Campaign ID     |  Campaign ID by the bank  |
|Communication Operator Message ID  |  operator Id for each communication done in messages |
| Call time       |Date of birth of the customer   |
| Status    | status of the repayment |

# **Let's Begin**

## **Knowing the Data**

### Import Libraries

In [1]:
import numpy as np 
import pandas as pd 
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings("ignore")
from datetime import datetime

### Dataset Loading

In [2]:
# Function to load the data 
def DataLoader(path,Date=None,date_cols=None):
    """
    A function to load the datset 
    Argumet - Path(path to the data file)
    return - dataframe
    """
    try:
        dataframe = pd.read_excel(path,index_col=Date,parse_dates=date_cols)
        return dataframe
    except: # if path is incorrect or does not exist
        print("path does not find")

    finally:
        print("operation performed on the  dataset Location")

In [3]:
CommunicationHistory_df = DataLoader("CommunicationHistory.xlsx",date_cols=['Call time'])

operation performed on the  dataset Location

In [4]:
date_cols = ['Due Date','DOB']
portfolio_df = DataLoader("Portfolio_data.xlsx",date_cols=date_cols)

operation performed on the  dataset Location

### Dataset First View

In [5]:
CommunicationHistory_df.head()

,Loan Number,Campaign ID,Communication Operator Message ID,Call time,Status
0,16748071234,161584404,21a1f7b1ce4d23d558e300626d5016c2,2022-12-02 02:59:40.973000+00:00,completed
1,16734601234,161584404,edecb5cd796826ef8bcde2f4814f16c2,2022-12-02 03:57:51.335000+00:00,completed
2,1631580,161307935,6a79ed24fa727ae9341f53a9df8816c2,2022-12-02 04:34:26.950000+00:00,completed
3,1631580,161307935,ce45ac657c26d5d10e6d1eb4aacc16c2,2022-12-02 04:34:57.213000+00:00,completed
4,1631580,161307935,6c864d7097f2df3eed4900ea892816c2,2022-12-02 04:36:21.594000+00:00,completed

In [6]:
portfolio_df.head()

   Loan Number   Due Date          State                  DOB  Loan Amount
0      1003431 2022-10-31      KARNATAKA  1987-02-09 00:00:00     240000.0
1      1004356 2022-10-31    MAHARASHTRA  1994-05-23 00:00:00      56000.0
2      1004464 2022-11-01  UTTAR PRADESH  1996-12-01 00:00:00      50000.0
3      1004626 2022-11-01         KERALA  1995-07-14 00:00:00      63000.0
4      1005011 2022-11-01    MAHARASHTRA  1994-05-30 00:00:00      50000.0

### Dataset Rows & Columns count

In [7]:
# Dataset Rows & Columns count
print(f"the CommunicationHistory dataset has toltal of  {CommunicationHistory_df.shape[0]} rows and {CommunicationHistory_df.shape[1]} columns")

the CommunicationHistory dataset has toltal of  70607 rows and 5 columns

In [8]:
# Dataset Rows & Columns count
print(f"the portfolio dataset has toltal of  {portfolio_df.shape[0]} rows and {portfolio_df.shape[1]} columns")

the portfolio dataset has toltal of  15962 rows and 5 columns

### Dataset Information

In [9]:
# Dataset Info
CommunicationHistory_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70607 entries, 0 to 70606
Data columns (total 5 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Loan Number                        70607 non-null  int64
 1   Campaign ID                        70607 non-null  int64
 2   Communication Operator Message ID  70597 non-null  object
 3   Call time                          70607 non-null  datetime64[ns, UTC]
 4   Status                             70607 non-null  object
dtypes: datetime64[ns, UTC](1), int64(2), object(2)
memory usage: 2.7+ MB

In [10]:
# portfolio Dataset Info
portfolio_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15962 entries, 0 to 15961
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Loan Number  15962 non-null  int64
 1   Due Date     15962 non-null  datetime64[ns]
 2   State        15962 non-null  object
 3   DOB          15961 non-null  object
 4   Loan Amount  15962 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 623.6+ KB

#### Duplicate Values

In [11]:
# CommunicationHistory Dataset Duplicate Value Count
CommunicationHistory_df.duplicated().sum()

0

In [12]:
# portfolio Dataset Duplicate Value Count
portfolio_df.duplicated().sum()

0

#### Missing Values/Null Values

In [13]:
# Missing Values/Null Values Count in CommunicationHistory dataset
CommunicationHistory_df.isna().sum().sort_values(ascending=False)

Communication Operator Message ID    10
Loan Number                           0
Campaign ID                           0
Call time                             0
Status                                0
dtype: int64

In [14]:
# Missing Values/Null Values Count in portfolio dataset
portfolio_df.isna().sum().sort_values(ascending=False)

DOB            1
Loan Number    0
Due Date       0
State          0
Loan Amount    0
dtype: int64

### Dataset Description

In [15]:
CommunicationHistory_df.describe(include='all')

,Loan Number,Campaign ID,Communication Operator Message ID,Call time,Status
count,7.060700e+04,7.060700e+04,70597,70607,70607
unique,NaN,NaN,70597,70563,2
top,NaN,NaN,21a1f7b1ce4d23d558e300626d5016c2,2022-12-03 13:16:19.023000+00:00,completed
freq,NaN,NaN,1,2,70589
first,NaN,NaN,NaN,2022-12-02 02:59:40.973000+00:00,NaN
last,NaN,NaN,NaN,2022-12-07 23:25:16.448000+00:00,NaN
mean,2.387413e+06,1.681513e+08,NaN,NaN,NaN
std,1.077388e+08,2.845385e+06,NaN,NaN,NaN
min,8.727770e+05,1.354742e+08,NaN,NaN,NaN
25%,1.635118e+06,1.654490e+08,NaN,NaN,NaN
50%,1.705979e+06,1.678209e+08,NaN,NaN,NaN
75%,1.778082e+06,1.707402e+08,NaN,NaN,NaN
max,1.674807e+10,1.735366e+08,NaN,NaN,NaN

In [16]:
portfolio_df.describe(include='all')

,Loan Number,Due Date,State,DOB,Loan Amount
count,1.596200e+04,15962,15962,15961,15962.000000
unique,NaN,30,40,6741,NaN
top,NaN,2022-11-25 00:00:00,MAHARASHTRA,1998-01-01 00:00:00,NaN
freq,NaN,1080,2538,56,NaN
first,NaN,2022-10-31 00:00:00,NaN,NaN,NaN
last,NaN,2022-11-29 00:00:00,NaN,NaN,NaN
mean,1.689427e+06,NaN,NaN,NaN,7362.359952
std,1.211048e+05,NaN,NaN,NaN,6398.129954
min,8.727770e+05,NaN,NaN,NaN,3000.000000
25%,1.640865e+06,NaN,NaN,NaN,5000.000000
50%,1.714308e+06,NaN,NaN,NaN,5017.000000
75%,1.778172e+06,NaN,NaN,NaN,7000.000000
max,1.881403e+06,NaN,NaN,NaN,240000.000000

In [17]:
#print unique value in categorical value 
#since the dataset is large numerical value whose unique number are less than should be focussed

def print_values(dataframe):
    for i in dataframe.columns.tolist():
        if dataframe[i].dtype=='O':
            print(f"the categorical column {i} have {dataframe[i].nunique()} unique values ")
            if dataframe[i].nunique() <=31 :
                print(f"the unique value in the columns are {dataframe[i].unique()}")
        else:
            print(f"the  numerical column {i} have {dataframe[i].nunique()} unique values ")
            if dataframe[i].nunique() <=15:
                print(f" the unique value in the columns are{dataframe[i].unique()}")

In [18]:
print_values(CommunicationHistory_df)

the  numerical column Loan Number have 11220 unique values
the  numerical column Campaign ID have 40 unique values
the categorical column Communication Operator Message ID have 70597 unique values
the  numerical column Call time have 70563 unique values
the categorical column Status have 2 unique values
the unique value in the columns are ['completed' 'FAILED']

In [19]:
print_values(portfolio_df)

the  numerical column Loan Number have 15962 unique values
the  numerical column Due Date have 30 unique values
the categorical column State have 40 unique values
the categorical column DOB have 6741 unique values
the  numerical column Loan Amount have 304 unique values

## Data Wrangling

**To perform opearationon dataset we have to merge the dataset,Since both the dataset have Loan number in common we would merge the dataset on Loan number**

In [20]:
#create final dataset by merging the two dataframe on  Loan Number column 
final_dataset = pd.merge(CommunicationHistory_df,portfolio_df,how='left', on='Loan Number')

In [21]:
final_dataset.head()

,Loan Number,Campaign ID,Communication Operator Message ID,Call time,Status,Due Date,State,DOB,Loan Amount
0,16748071234,161584404,21a1f7b1ce4d23d558e300626d5016c2,2022-12-02 02:59:40.973000+00:00,completed,NaT,NaN,NaN,NaN
1,16734601234,161584404,edecb5cd796826ef8bcde2f4814f16c2,2022-12-02 03:57:51.335000+00:00,completed,NaT,NaN,NaN,NaN
2,1631580,161307935,6a79ed24fa727ae9341f53a9df8816c2,2022-12-02 04:34:26.950000+00:00,completed,NaT,NaN,NaN,NaN
3,1631580,161307935,ce45ac657c26d5d10e6d1eb4aacc16c2,2022-12-02 04:34:57.213000+00:00,completed,NaT,NaN,NaN,NaN
4,1631580,161307935,6c864d7097f2df3eed4900ea892816c2,2022-12-02 04:36:21.594000+00:00,completed,NaT,NaN,NaN,NaN

#### Distribution of loans across different states

In [22]:
#groupt the datasetby state and calculate avg loan amount across states
final_dataset.groupby("State")["Loan Amount"].mean().reset_index().sort_values("Loan Amount",ascending= False)

                        State   Loan Amount
14           HIMACHAL PRADESH  13317.750000
3           Arunachal Pradesh  12769.230769
23                Maharashtra  12190.476190
32                     Sikkim  11807.827586
12                        Goa   9924.816667
5                 CHATTISGARH   9267.178125
19                     KERALA   8270.710578
18                  KARNATAKA   8146.555493
33                 TAMIL NADU   7955.937760
38                WEST BENGAL   7743.899696
29                     PUNJAB   7709.016014
10                      DELHI   7646.889406
11                    GUJARAT   7585.664162
21                MAHARASHTRA   7362.929871
37                UTTARAKHAND   7314.757576
34                  TELANGANA   7213.160365
17                  JHARKHAND   7208.865079
31                  RAJASTHAN   7132.352372
1              ANDHRA PRADESH   7118.952555
13                    HARYANA   7090.189330
28                     ODISHA   7073.584989
26                    Mizoram   7000.000000
22             Madhya Pradesh   7000.000000
36              UTTAR PRADESH   6981.753107
30                Pondicherry   6929.682081
20             MADHYA PRADESH   6862.536786
4                       BIHAR   6819.619411
2                       ASSAM   6791.961842
6                  Chandigarh   6703.468468
16            JAMMU & KASHMIR   6332.377551
27                   Nagaland   6234.692308
9                 DAMAN & DIU   6189.647059
35                    TRIPURA   6054.064516
24                    Manipur   5503.462963
25                  Meghalaya   5223.400000
7                 Chattisgarh   5017.000000
8        DADRA & NAGAR HAVELI   5017.000000
15                    Haryana   5000.000000
0   ANDAMAN & NICOBAR ISLANDS   5000.000000

In [46]:
#groupt the datasetby state and calculate avg loan amount across states
final_dataset.groupby("State")["Loan Amount"].count().reset_index().sort_values("Loan Amount",ascending= False)

                        State  Loan Amount
21                MAHARASHTRA        10264
18                  KARNATAKA         8848
33                 TAMIL NADU         7198
34                  TELANGANA         6030
1              ANDHRA PRADESH         5459
36              UTTAR PRADESH         5310
11                    GUJARAT         4258
31                  RAJASTHAN         3309
20             MADHYA PRADESH         2800
10                      DELHI         2794
38                WEST BENGAL         2303
13                    HARYANA         2118
4                       BIHAR         1968
28                     ODISHA         1812
19                     KERALA         1541
29                     PUNJAB         1124
2                       ASSAM          760
5                 CHATTISGARH          640
17                  JHARKHAND          630
37                UTTARAKHAND          330
14           HIMACHAL PRADESH          212
16            JAMMU & KASHMIR          196
30                Pondicherry          173
6                  Chandigarh          111
35                    TRIPURA           93
12                        Goa           60
24                    Manipur           54
25                  Meghalaya           35
9                 DAMAN & DIU           34
32                     Sikkim           29
27                   Nagaland           26
23                Maharashtra           21
15                    Haryana           15
3           Arunachal Pradesh           13
7                 Chattisgarh            8
8        DADRA & NAGAR HAVELI            5
26                    Mizoram            4
0   ANDAMAN & NICOBAR ISLANDS            4
22             Madhya Pradesh            2

**Himachal pradesh have the highest Loan amount average and Andaman &Nicobar islands have the lowest Loan amount sanctioned across the city**

#### Distribution of loans across different amounts

In [23]:
# Divide the data into categories
bins =  [1000, 5000, 6000, 7000, 8000, 9000, 10000, 11000, 15000]
# Use the `cut` function to assign each data point to a category
categories = pd.cut(final_dataset["Loan Amount"], bins, labels=["1000-5000", "5000-6000","6000-7000","7000-8000","8000-9000","9000-10000", "10000-11000","11000-15000"])

# Count the number of data points in each category
counts = categories.value_counts().reset_index().rename(columns={'Loan Amount': 'Count'})

In [24]:
counts

         index  Count
0    1000-5000  32231
1    6000-7000  14882
2    5000-6000  10170
3   9000-10000   3198
4  11000-15000   2394
5    7000-8000   1656
6  10000-11000    791
7    8000-9000    303

#### Distribution of customers by age

In [25]:
#select only those rows where the DOB is not null
dob_dataframe = final_dataset[final_dataset["DOB"].notnull()]

In [26]:
# convert to time stamp 
dob_dataframe["DOB"]= pd.to_datetime(dob_dataframe["DOB"],format='%Y-%m-%d %H:%M:%S')

In [27]:
today = datetime.now()#present day
dob_dataframe["Age"] = (today-dob_dataframe["DOB"]).astype('<m8[Y]')

In [28]:
dob_dataframe.groupby("Age")["Loan Amount"].mean().reset_index().sort_values("Age",ascending= True)

     Age  Loan Amount
0   18.0  6651.107843
1   19.0  5621.002677
2   20.0  5962.259259
3   21.0  6083.694260
4   22.0  6601.359276
5   23.0  6786.066783
6   24.0  7033.344296
7   25.0  7659.818398
8   26.0  8055.844112
9   27.0  7090.451247
10  28.0  7686.244894
11  29.0  7950.135366
12  30.0  8118.145147
13  31.0  8260.089926
14  32.0  7995.941176
15  33.0  8242.677174
16  34.0  7339.231898
17  35.0  7874.953958
18  36.0  8023.411255
19  37.0  7900.719198
20  38.0  8437.352060
21  39.0  8270.504980
22  40.0  8488.492260
23  41.0  6821.977433
24  42.0  8326.661194
25  43.0  7974.910092
26  44.0  8988.576801
27  45.0  6826.132791
28  46.0  9131.970109
29  47.0  6397.119601
30  48.0  6809.187291
31  49.0  8633.500000
32  50.0  8434.178771
33  51.0  8720.921260
34  52.0  7866.037559
35  53.0  5671.630952
36  54.0  5783.913793
37  55.0  5159.672131
38  56.0  5008.185185
39  57.0  5013.333333
40  58.0  5012.823529
41  59.0  5000.000000
42  60.0  5000.000000
43  61.0  5000.000000
44  62.0  5018.342857
45  63.0  5014.875000
46  64.0  5000.000000
47  68.0  5083.000000
48  70.0  5000.000000
49  72.0  5000.000000
50  79.0  5063.000000

**Divide the age into four categories and see the loan amount distribution in thes categories**

In [39]:
# define the age_category function
def age_category(dataframe):
    if dataframe["Age"] >= 18 and dataframe["Age"] <=24 :
        dataframe["people Age section"] = "people Early 20s"
    elif dataframe["Age"] >=25 and dataframe["Age"] <=30 :
        dataframe["people Age section"] = "people in Mid 20s"
    elif dataframe["Age"] >=31 and dataframe["Age"] <=40 :
        dataframe["people Age section"] = "people in 30s"
    elif dataframe["Age"] >=41 and dataframe["Age"] <=50 :
        dataframe["people Age section"] = "people in 40s"
    elif dataframe["Age"] >=51 and dataframe["Age"] <=60 :
        dataframe["people Age section"] = "people in 50s"
    elif dataframe["Age"] >=61 and dataframe["Age"] <=70 :
        dataframe["people Age section"] = "people in 60s"
    elif dataframe["Age"] >=71 and dataframe["Age"] <=80 :
        dataframe["people Age section"] = "people in 70s"
    return dataframe

In [40]:
age_dataset = dob_dataframe.apply(age_category, axis=1)

In [41]:
age_dataset.groupby("people Age section")["Loan Amount"].mean().reset_index().sort_values("Loan Amount",ascending= True)

  people Age section  Loan Amount
4      people in 60s  5021.213333
5      people in 70s  5043.105263
0   people Early 20s  6597.941050
3      people in 50s  6724.163912
6  people in Mid 20s  7747.152308
2      people in 40s  7841.033528
1      people in 30s  8051.157373

In [45]:
age_dataset.groupby("people Age section")["Loan Amount"].count().reset_index().sort_values("Loan Amount",ascending= True)

  people Age section  Loan Amount
5      people in 70s           19
4      people in 60s           75
3      people in 50s          726
2      people in 40s         4271
1      people in 30s        18275
0   people Early 20s        20424
6  people in Mid 20s        26801

**People in their 3o have the highest loan amount Distribution followed by people in 40s However people in their 60s have lowest Loan amount distribution followed by people in 70s and people in early 20s**

#### Distribution of loans by due dates

In [58]:
age_dataset.groupby("Due Date")["Loan Amount"].mean().reset_index().sort_values("Loan Amount",ascending= True)

     Due Date    Loan Amount
14 2022-11-14    6115.435286
21 2022-11-21    6472.757015
15 2022-11-15    6490.685978
19 2022-11-19    6753.528858
20 2022-11-20    6765.244860
25 2022-11-25    6782.857967
12 2022-11-12    6905.481984
13 2022-11-13    6965.586239
5  2022-11-05    7330.517038
2  2022-11-02    7367.940163
6  2022-11-06    7401.303701
8  2022-11-08    7434.464968
7  2022-11-07    7686.543129
1  2022-11-01    7816.673625
18 2022-11-18    7828.538913
17 2022-11-17    7876.599262
10 2022-11-10    7916.286360
4  2022-11-04    7931.927431
22 2022-11-22    7960.516511
16 2022-11-16    7991.469302
11 2022-11-11    7991.817808
9  2022-11-09    8010.115604
3  2022-11-03    8210.676092
23 2022-11-23    8352.628610
24 2022-11-24    9288.734899
26 2022-11-26   14209.167059
29 2022-11-29   18513.828571
28 2022-11-28   24486.532258
27 2022-11-27   29754.891566
0  2022-10-31  240000.000000

In [48]:
# create a new column containing the day component of the datetime column
age_dataset['Due_date_day'] = age_dataset['Due Date'].dt.day

In [53]:
def week_of_month(dataframe):
    if dataframe['Due_date_day'] >=1 and dataframe['Due_date_day'] <=7 :
        dataframe['week']= "1st week of month"
    elif dataframe['Due_date_day'] >=8 and dataframe['Due_date_day'] <=14 :
        dataframe['week']= "2nd week of month"
    elif dataframe['Due_date_day'] >=15 and dataframe['Due_date_day'] <=22 :
        dataframe['week']= "3rd week of month"
    elif dataframe['Due_date_day'] >=23 and dataframe['Due_date_day'] <=31 :
        dataframe['week']= "4th week of month"
        
    return dataframe

In [57]:
week_month_dataset = age_dataset.apply(week_of_month, axis=1)

In [60]:
week_month_dataset.groupby("week")["Loan Amount"].mean().reset_index().sort_values("Loan Amount",ascending= True)

                week  Loan Amount
2  3rd week of month  7142.345338
1  2nd week of month  7264.346843
0  1st week of month  7670.235630
3  4th week of month  8284.446340

In [61]:
week_month_dataset.groupby("week")["Loan Amount"].count().reset_index().sort_values("Loan Amount",ascending= True)

                week  Loan Amount
3  4th week of month         9016
1  2nd week of month        16013
0  1st week of month        22599
2  3rd week of month        22963

#### Unique number of customers contacted every day - only completed calls are to be considered - How many unique borrowers did we contact on day 1, day 2 etc.

In [81]:
#select only those rows were status is completed 
unique_number_dataset = final_dataset[final_dataset["Status"] =="completed"]

In [83]:
#separate unique days 
unique_number_dataset["Call time day"] = unique_number_dataset["Call time"].dt.day

In [102]:
#group the Loan Number with days
Unique_customers_contacted = unique_number_dataset.groupby('Call time day')["Loan Number"].nunique().reset_index()

In [103]:
Unique_customers_contacted

   Call time day  Loan Number
0              2         7845
1              3         6929
2              4         6103
3              5         6284
4              6         5665
5              7         4261

#### Number of customers not contacted on every day. How many borrowers are not contacted on day 1, day 2 etc